{
  "navbar":{
     "home":"Startseite",
     "about":"Über Mich",
     "projects":"Projekte",
     "skills":"Kenntnisse",
     "experience":"Erfahrungen",
     "education":"Ausbildung"
  },
  "about":{
     "title":"Über Mich",
     "description":{
        "1":"Willkommen auf meiner Website!",
        "2":"Hier präsentiere ich meine bisherigen und auch zukünftigen selbst programmierten Projekte und teile meine Leidenschaft für Web-Development und Machine Learning. Mein Ziel ist es, durch meine Arbeit einen passenden Job zu finden, bei dem ich meine Fähigkeiten und Interessen optimal einsetzen kann.",
        "3":"Eines meiner aktuellen Projekte ist eine Vogel Identifikations Applikation, bei der ich Web-Development und Machine Learning kombiniere. Seit Mai 2023 arbeite ich mit Begeisterung daran und obwohl das Projekt noch in der Entwicklung ist, können Sie bereits eine funktionierende Version aufrufen.",
        "4":"Meine Programmierreise begann im April 2020 während meines Studiums, als ich mich in meiner Freizeit dem Programmieren widmete. Was als persönliches Interesse begann, entwickelte sich schnell zu einer Leidenschaft, die mich dazu motivierte, eine berufliche Laufbahn in diesem Bereich einzuschlagen.",
        "5":"Um den Einstieg in die Branche zu erleichtern, absolvierte ich ein intensives neunmonatiges Bootcamp für Data-Analysts bei Masterschool. Während dieser Zeit hatte ich die Möglichkeit, mein Wissen zu vertiefen und praktische Erfahrungen zu sammeln. Im Anschluss daran begann ich bei der Semotec GmbH zu arbeiten, einem kleinen IT-Unternehmen in Wien, das sich auf Web-Development spezialisiert hat. Dort war ich an einem beeindruckenden Projekt beteiligt, dem E-Tresor für die Firma A-Trust, das über 10 Jahre hinweg implementiert und betreut wurde. Aufgrund der Größe des Unternehmens konnte ich mich mit verschiedenen Aspekten der Entwicklung auseinandersetzen und wertvolle Erfahrungen sowohl im Frontend- als auch im Backend-Bereich sammeln.",
        "6":"Nach Beendigung meines Dienstverhältnisses entschied ich mich, meine Kenntnisse zu erweitern und begann, das moderne Framework Angular zu lernen, um meine Effizienz in der Arbeit zu steigern.",
        "7":"Parallel zu meiner beruflichen Erfahrung habe ich ein privates Onlineshop-Projekt realisiert, bei dem ich eine Applikation von Grund auf entwickelt habe. Dieses Projekt hat mir viel Wissen und praktische Fähigkeiten vermittelt.",
        "8":"Ich lade Sie herzlich ein, meine Website zu erkunden und sich einen Überblick über meine Projekte zu verschaffen. Falls Sie Fragen haben oder an einer Zusammenarbeit interessiert sind, stehe ich Ihnen gerne zur Verfügung. Vielen Dank für Ihren Besuch!"
     },
     "personal":{
        "position":{
           "property":"Position",
           "value":"Web-Developer"
        },
        "experience":{
           "property":"Experience",
           "value":"3 Years"
        },
        "age":{
           "property":"Age",
           "value":"26"
        },
        "place_of_birth":{
           "property":"Geburtsort",
           "value":"München , Deutschland"
        },
        "languages":{
           "property":"Sprachen",
           "value":"Deutsch, Englisch, Spanisch (noch Anfänger)"
        }
     }
  },
  "projects":{
     "title":"Projekte",
     "buttons":{
        "source":{
           "label":"Code",
           "tooltip":"View source code"
        },
        "preview":{
           "label":"View",
           "tooltip":"Go to website"
        },
        "expand":{
           "label":"Show more",
           "tooltip":"Show more details"
        },
        "collapse":{
           "label":"Show less",
           "tooltip":"Show less details"
        }
     },
     "birds":{
        "title":"",
        "description":{
           "1":"",
           "2":"",
           "3":""
        },
        "date":""
     },
     "onlineshop":{
        "title":"Online Shop",
        "description":{
           "1":"Der Angular Online Shop ist eine Demo-Anwendung, die entwickelt wurde, um das neu erworbene Wissen in der Praxis umzusetzen. Es handelt sich nicht um einen echten Online Shop, sondern um eine Simulation, die es ermöglicht, verschiedene Konzepte und Funktionen zu testen. Es handelt sich nicht um einen echten Online Shop, sondern um eine Demo,",
           "2":"die es mir ermöglicht hat, verschiedene Konzepte und Funktionen zu testen.",
           "3":"Die Demo-Anwendung bietet eine Vielzahl von Produkten aus unterschiedlichen Kategorien. Die Benutzer können die Produkte durchsuchen, Details anzeigen und sie in den Warenkorb legen. Der Warenkorb ermöglicht es den Benutzern, ihre ausgewählten Produkte zu überprüfen und den Bestellungsabwicklungsvorgang zu durchlaufen.",
           "4":"Es ist wichtig zu beachten, dass es sich bei dieser Demo um eine reine Testumgebung handelt. Es gibt keine echten Produkte oder Zahlungsfunktionen. Daher können die Benutzer alle Funktionen und Prozesse sorgenfrei testen, ohne tatsächlich Geld auszugeben.",
           "5":"Die Demo-Anwendung enthält auch ein Admin-Tool, das zusätzliche Funktionen bereitstellt. In der Admin-Ansicht hat der Administrator die Möglichkeit, neue Produkte hinzuzufügen und bestehende Produkte zu löschen. Darüber hinaus kann der Administrator alle Bestellungen einsehen und verwalten. Zur Authentifizierung wird Google Authentication implementiert, sodass nur autorisierte Benutzer Zugriff auf die Admin-Funktionen haben.",
           "6":"Sobald sich ein Benutzer erfolgreich angemeldet hat, erhält er Zugriff auf seine eigenen Produkt- und Bestelldaten. Dadurch können alle Funktionen, wie das Löschen von Produkten oder das Hinzufügen von Produkten, getestet werden, ohne dass sie den allgemeinen Datensatz beeinflussen und die Daten anderer Benutzer gefährden."
        },
        "date":"März 2023 - Mai 2023"
     }
  },
  "skills":"",
  "experience":{
     "title":"Experience",
     "semotec":{
        "company":"Semotec - IT Services GmbH",
        "job":"Web-Developer - Projekt E-Tresor",
        "task":{
           "1":"Lösen von Tickets oder Fehlerberichten, um Probleme in Webanwendungen zu identifizieren, zu debuggen und zu beheben.",
           "2":"Durchführung von Refactoring-Arbeiten, um den bestehenden Code zu optimieren, die Wartbarkeit zu verbessern und die Effizienz der Anwendung zu steigern.",
           "3":"Implementierung neuer Features",
           "4":"Dokumentation des Codes, der Systemarchitektur und der Entwicklungsschritte, um die Wartbarkeit und Nachvollziehbarkeit zu gewährleisten.",
           "5":"Erstellung und Ausführung von SQL-Abfragen zur Datenmanipulation, Abfrageoptimierung und Datenbankintegration in Webanwendungen.",
           "6":"Zusammenführen von Codeänderungen und -zweigen (Merging) mittels Versionskontrollsystemen wie TortoiseHg und Git."
        },
        "date":"März 2021 - März 2023"
     }
  },
  "education":{
     "title":"Ausbildung",
     "masterschool":{
        "institution":"Masterschool",
        "degree":"Zertifikat - Data-Analyst",
        "program":"Data-Analyst - Coding Bootcamp",
        "date":"Dezember 2020 - August 2021"
     },
     "boku":{
        "institution":"Universität für Bodenkultur",
        "degree":"Bachelor of Science",
        "program":"Umwelt- und Bioressourcenmanagement",
        "date":"März 2016 - Februar 2020"
     },
     "school":{
        "institution":"Gymnasium Vilshofen",
        "degree":"Allgemeines Abitur",
        "program":"Gymnasium",
        "date":"September 2007 - April 2015"
     }
  }
}